#! python
# -*- coding: utf-8 -*-

"""Роскомнадзор запретил букву а."""

# int: echo "роскомнадзор" | python .\roskomnadzor.py
# out: роскомнадзор запретил букву а
# роскомндзор зпретил букву б
# роскомндзор зпретил укву в
# роскомндзор зпретил уку д
# роскомнзор зпретил уку е
# роскомнзор зпртил уку з
# роскомнор пртил уку и
# роскомнор пртл уку к
# росомнор пртл уу л
# росомнор прт уу м
# росонор прт уу н
# росоор прт уу о
# рср прт уу п
# рср рт уу р
# с т уу с
# т уу т
# уу у

word = input() + ' запретил букву'
abc = [chr(ord('а') + i) for i in range(32)]
for i in abc:
    if i in word:
        print(word + ' ' + i)
        word = word.replace(i, '').replace('  ', ' ')
        word = word.strip(' ')
